/*                                                                         */
/*                                                                         */
/* Generated by Semifore, Inc. csrCompile                                  */
/*    C Header output                                                      */

#ifndef _PU_TIMERS_H_
#define _PU_TIMERS_H_


/* ####################################################################### */
/*        ENUMERATION MACROS                                               */
/* ####################################################################### */

/* Enumeration: pu_DW_apb_timers::TIMER1CONTROLREG::TIMER_ENABLE::TIMER_ENABLE */
/* Source filename: pu_timers.csr, line: 68                                */
#define PU_DW_APB_TIMERS_TIMER1CONTROLREG_TIMER_ENABLE_TIMER_ENABLE_DISABLE 0x0u
#define PU_DW_APB_TIMERS_TIMER1CONTROLREG_TIMER_ENABLE_TIMER_ENABLE_ENABLED 0x1u

/* Enumeration: pu_DW_apb_timers::TIMER1CONTROLREG::TIMER_INTERRUPT_MASK::TIMER_INTERRUPT_MASK */
/* Source filename: pu_timers.csr, line: 106                               */
#define PU_DW_APB_TIMERS_TIMER1CONTROLREG_TIMER_INTERRUPT_MASK_TIMER_INTERRUPT_MASK_MASKED 0x1u
#define PU_DW_APB_TIMERS_TIMER1CONTROLREG_TIMER_INTERRUPT_MASK_TIMER_INTERRUPT_MASK_UNMASKED 0x0u

/* Enumeration: pu_DW_apb_timers::TIMER1CONTROLREG::TIMER_MODE::TIMER_MODE */
/* Source filename: pu_timers.csr, line: 88                                */

#define PU_DW_APB_TIMERS_TIMER6LOADCOUNT2_TIMER6LOADCOUNT2_GET(x) \
   ((x) & 0xfffffffful)
#define PU_DW_APB_TIMERS_TIMER6LOADCOUNT2_TIMER6LOADCOUNT2_SET(x) \
   ((x) & 0xfffffffful)
#define PU_DW_APB_TIMERS_TIMER6LOADCOUNT2_TIMER6LOADCOUNT2_MODIFY(r, x) \
   ((x) & 0xfffffffful)

/* Register type: pu_DW_apb_timers::TIMER7LOADCOUNT2                       */
/* Register template: pu_DW_apb_timers::TIMER7LOADCOUNT2                   */
/* Source filename: pu_timers.csr, line: 1935                              */
/* Field member: pu_DW_apb_timers::TIMER7LOADCOUNT2.TIMER7LOADCOUNT2       */
/* Source filename: pu_timers.csr, line: 1943                              */
#define PU_DW_APB_TIMERS_TIMER7LOADCOUNT2_TIMER7LOADCOUNT2_MSB 31u
#define PU_DW_APB_TIMERS_TIMER7LOADCOUNT2_TIMER7LOADCOUNT2_LSB 0u
#define PU_DW_APB_TIMERS_TIMER7LOADCOUNT2_TIMER7LOADCOUNT2_WIDTH 32u
#define PU_DW_APB_TIMERS_TIMER7LOADCOUNT2_TIMER7LOADCOUNT2_READ_ACCESS 1u
#define PU_DW_APB_TIMERS_TIMER7LOADCOUNT2_TIMER7LOADCOUNT2_WRITE_ACCESS 1u
#define PU_DW_APB_TIMERS_TIMER7LOADCOUNT2_TIMER7LOADCOUNT2_RESET 0x00000000ul
#define PU_DW_APB_TIMERS_TIMER7LOADCOUNT2_TIMER7LOADCOUNT2_FIELD_MASK 0xfffffffful
#define PU_DW_APB_TIMERS_TIMER7LOADCOUNT2_TIMER7LOADCOUNT2_GET(x) \
   ((x) & 0xfffffffful)
#define PU_DW_APB_TIMERS_TIMER7LOADCOUNT2_TIMER7LOADCOUNT2_SET(x) \
   ((x) & 0xfffffffful)
#define PU_DW_APB_TIMERS_TIMER7LOADCOUNT2_TIMER7LOADCOUNT2_MODIFY(r, x) \
   ((x) & 0xfffffffful)

/* Register type: pu_DW_apb_timers::TIMER8LOADCOUNT2                       */
/* Register template: pu_DW_apb_timers::TIMER8LOADCOUNT2                   */
/* Source filename: pu_timers.csr, line: 1953                              */
/* Field member: pu_DW_apb_timers::TIMER8LOADCOUNT2.TIMER8LOADCOUNT2       */
/* Source filename: pu_timers.csr, line: 1961                              */
#define PU_DW_APB_TIMERS_TIMER8LOADCOUNT2_TIMER8LOADCOUNT2_MSB 31u
#define PU_DW_APB_TIMERS_TIMER8LOADCOUNT2_TIMER8LOADCOUNT2_LSB 0u
#define PU_DW_APB_TIMERS_TIMER8LOADCOUNT2_TIMER8LOADCOUNT2_WIDTH 32u
#define PU_DW_APB_TIMERS_TIMER8LOADCOUNT2_TIMER8LOADCOUNT2_READ_ACCESS 1u
#define PU_DW_APB_TIMERS_TIMER8LOADCOUNT2_TIMER8LOADCOUNT2_WRITE_ACCESS 1u
#define PU_DW_APB_TIMERS_TIMER8LOADCOUNT2_TIMER8LOADCOUNT2_RESET 0x00000000ul
#define PU_DW_APB_TIMERS_TIMER8LOADCOUNT2_TIMER8LOADCOUNT2_FIELD_MASK 0xfffffffful
#define PU_DW_APB_TIMERS_TIMER8LOADCOUNT2_TIMER8LOADCOUNT2_GET(x) \
   ((x) & 0xfffffffful)
#define PU_DW_APB_TIMERS_TIMER8LOADCOUNT2_TIMER8LOADCOUNT2_SET(x) \
   ((x) & 0xfffffffful)
#define PU_DW_APB_TIMERS_TIMER8LOADCOUNT2_TIMER8LOADCOUNT2_MODIFY(r, x) \
   ((x) & 0xfffffffful)

/* ####################################################################### */
/*        TYPE DEFINITIONS                                                 */
/* ####################################################################### */

/* Typedef for Addressmap: pu_DW_apb_timers                                */
/* Source filename: pu_timers.csr, line: 1971                              */
typedef struct {
   volatile uint32_t TIMER1LOADCOUNT; /**< Offset 0x0 (R/W) */
   uint32_t TIMER1CURRENTVAL; /**< Offset 0x4 (R) */
   volatile uint32_t TIMER1CONTROLREG; /**< Offset 0x8 (R/W) */
   uint32_t TIMER1EOI; /**< Offset 0xc (R) */
   uint32_t TIMER1INTSTAT; /**< Offset 0x10 (R) */
   volatile uint32_t TIMER2LOADCOUNT; /**< Offset 0x14 (R/W) */
   uint32_t TIMER2CURRENTVAL; /**< Offset 0x18 (R) */
   volatile uint32_t TIMER2CONTROLREG; /**< Offset 0x1c (R/W) */
   uint32_t TIMER2EOI; /**< Offset 0x20 (R) */
   uint32_t TIMER2INTSTAT; /**< Offset 0x24 (R) */
   volatile uint32_t TIMER3LOADCOUNT; /**< Offset 0x28 (R/W) */
   uint32_t TIMER3CURRENTVAL; /**< Offset 0x2c (R) */
   volatile uint32_t TIMER3CONTROLREG; /**< Offset 0x30 (R/W) */
   uint32_t TIMER3EOI; /**< Offset 0x34 (R) */
   uint32_t TIMER3INTSTAT; /**< Offset 0x38 (R) */
   volatile uint32_t TIMER4LOADCOUNT; /**< Offset 0x3c (R/W) */
   uint32_t TIMER4CURRENTVAL; /**< Offset 0x40 (R) */
   volatile uint32_t TIMER4CONTROLREG; /**< Offset 0x44 (R/W) */
   uint32_t TIMER4EOI; /**< Offset 0x48 (R) */
   uint32_t TIMER4INTSTAT; /**< Offset 0x4c (R) */
   volatile uint32_t TIMER5LOADCOUNT; /**< Offset 0x50 (R/W) */
   uint32_t TIMER5CURRENTVAL; /**< Offset 0x54 (R) */
   volatile uint32_t TIMER5CONTROLREG; /**< Offset 0x58 (R/W) */
   uint32_t TIMER5EOI; /**< Offset 0x5c (R) */
   uint32_t TIMER5INTSTAT; /**< Offset 0x60 (R) */
   volatile uint32_t TIMER6LOADCOUNT; /**< Offset 0x64 (R/W) */
   uint32_t TIMER6CURRENTVAL; /**< Offset 0x68 (R) */
   volatile uint32_t TIMER6CONTROLREG; /**< Offset 0x6c (R/W) */
   uint32_t TIMER6EOI; /**< Offset 0x70 (R) */
   uint32_t TIMER6INTSTAT; /**< Offset 0x74 (R) */
   volatile uint32_t TIMER7LOADCOUNT; /**< Offset 0x78 (R/W) */
   uint32_t TIMER7CURRENTVAL; /**< Offset 0x7c (R) */
   volatile uint32_t TIMER7CONTROLREG; /**< Offset 0x80 (R/W) */
   uint32_t TIMER7EOI; /**< Offset 0x84 (R) */
   uint32_t TIMER7INTSTAT; /**< Offset 0x88 (R) */
   volatile uint32_t TIMER8LOADCOUNT; /**< Offset 0x8c (R/W) */
   uint32_t TIMER8CURRENTVAL; /**< Offset 0x90 (R) */
   volatile uint32_t TIMER8CONTROLREG; /**< Offset 0x94 (R/W) */
   uint32_t TIMER8EOI; /**< Offset 0x98 (R) */
   uint32_t TIMER8INTSTAT; /**< Offset 0x9c (R) */
   uint32_t TimersIntStatus; /**< Offset 0xa0 (R) */
   uint32_t TimersEOI; /**< Offset 0xa4 (R) */
   uint32_t TimersRawIntStatus; /**< Offset 0xa8 (R) */
   uint32_t TIMERS_COMP_VERSION; /**< Offset 0xac (R) */
   volatile uint32_t TIMER1LOADCOUNT2; /**< Offset 0xb0 (R/W) */
   volatile uint32_t TIMER2LOADCOUNT2; /**< Offset 0xb4 (R/W) */
   volatile uint32_t TIMER3LOADCOUNT2; /**< Offset 0xb8 (R/W) */
   volatile uint32_t TIMER4LOADCOUNT2; /**< Offset 0xbc (R/W) */
   volatile uint32_t TIMER5LOADCOUNT2; /**< Offset 0xc0 (R/W) */
   volatile uint32_t TIMER6LOADCOUNT2; /**< Offset 0xc4 (R/W) */
   volatile uint32_t TIMER7LOADCOUNT2; /**< Offset 0xc8 (R/W) */
   volatile uint32_t TIMER8LOADCOUNT2; /**< Offset 0xcc (R/W) */
} Pu_DW_apb_timers, *PTR_Pu_DW_apb_timers;

#endif
