/*                                                                         */
/*                                                                         */
/* Generated by Semifore, Inc. csrCompile                                  */
/*    C Header output                                                      */

#ifndef _PU_WDT_H_
#define _PU_WDT_H_


/* ####################################################################### */
/*        ENUMERATION MACROS                                               */
/* ####################################################################### */

/* Enumeration: pu_DW_apb_wdt::WDT_COMP_PARAM_1::APB_DATA_WIDTH::APB_DATA_WIDTH */
/* Source filename: pu_wdt.csr, line: 724                                  */
#define PU_DW_APB_WDT_WDT_COMP_PARAM_1_APB_DATA_WIDTH_APB_DATA_WIDTH_APB_16BITS 0x1u
#define PU_DW_APB_WDT_WDT_COMP_PARAM_1_APB_DATA_WIDTH_APB_DATA_WIDTH_APB_32BITS 0x2u
#define PU_DW_APB_WDT_WDT_COMP_PARAM_1_APB_DATA_WIDTH_APB_DATA_WIDTH_APB_8BITS 0x0u

/* Enumeration: pu_DW_apb_wdt::WDT_COMP_PARAM_1::WDT_ALWAYS_EN::WDT_ALWAYS_EN */
/* Source filename: pu_wdt.csr, line: 566                                  */
#define PU_DW_APB_WDT_WDT_COMP_PARAM_1_WDT_ALWAYS_EN_WDT_ALWAYS_EN_DISABLED 0x0u
#define PU_DW_APB_WDT_WDT_COMP_PARAM_1_WDT_ALWAYS_EN_WDT_ALWAYS_EN_ENABLED 0x1u

/* Enumeration: pu_DW_apb_wdt::WDT_COMP_PARAM_1::WDT_DFLT_RMOD::WDT_DFLT_RMOD */
/* Source filename: pu_wdt.csr, line: 589                                  */

#define PU_DW_APB_WDT_WDT_COMP_PARAM_1_WDT_ALWAYS_EN_FIELD_MASK 0x00000001ul
#define PU_DW_APB_WDT_WDT_COMP_PARAM_1_WDT_ALWAYS_EN_GET(x) \
   ((x) & 0x00000001ul)
#define PU_DW_APB_WDT_WDT_COMP_PARAM_1_WDT_ALWAYS_EN_SET(x) \
   ((x) & 0x00000001ul)
#define PU_DW_APB_WDT_WDT_COMP_PARAM_1_WDT_ALWAYS_EN_MODIFY(r, x) \
   (((x) & 0x00000001ul) | ((r) & 0xfffffffeul))

/* Register type: pu_DW_apb_wdt::WDT_COMP_VERSION                          */
/* Register template: pu_DW_apb_wdt::WDT_COMP_VERSION                      */
/* Source filename: pu_wdt.csr, line: 792                                  */
/* Field member: pu_DW_apb_wdt::WDT_COMP_VERSION.WDT_COMP_VERSION          */
/* Source filename: pu_wdt.csr, line: 798                                  */
#define PU_DW_APB_WDT_WDT_COMP_VERSION_WDT_COMP_VERSION_MSB 31u
#define PU_DW_APB_WDT_WDT_COMP_VERSION_WDT_COMP_VERSION_LSB 0u
#define PU_DW_APB_WDT_WDT_COMP_VERSION_WDT_COMP_VERSION_WIDTH 32u
#define PU_DW_APB_WDT_WDT_COMP_VERSION_WDT_COMP_VERSION_READ_ACCESS 1u
#define PU_DW_APB_WDT_WDT_COMP_VERSION_WDT_COMP_VERSION_WRITE_ACCESS 0u
#define PU_DW_APB_WDT_WDT_COMP_VERSION_WDT_COMP_VERSION_RESET 0x3131312aul
#define PU_DW_APB_WDT_WDT_COMP_VERSION_WDT_COMP_VERSION_FIELD_MASK 0xfffffffful
#define PU_DW_APB_WDT_WDT_COMP_VERSION_WDT_COMP_VERSION_GET(x) \
   ((x) & 0xfffffffful)
#define PU_DW_APB_WDT_WDT_COMP_VERSION_WDT_COMP_VERSION_SET(x) \
   ((x) & 0xfffffffful)
#define PU_DW_APB_WDT_WDT_COMP_VERSION_WDT_COMP_VERSION_MODIFY(r, x) \
   ((x) & 0xfffffffful)

/* Register type: pu_DW_apb_wdt::WDT_COMP_TYPE                             */
/* Register template: pu_DW_apb_wdt::WDT_COMP_TYPE                         */
/* Source filename: pu_wdt.csr, line: 807                                  */
/* Field member: pu_DW_apb_wdt::WDT_COMP_TYPE.WDT_COMP_TYPE                */
/* Source filename: pu_wdt.csr, line: 813                                  */
#define PU_DW_APB_WDT_WDT_COMP_TYPE_WDT_COMP_TYPE_MSB 31u
#define PU_DW_APB_WDT_WDT_COMP_TYPE_WDT_COMP_TYPE_LSB 0u
#define PU_DW_APB_WDT_WDT_COMP_TYPE_WDT_COMP_TYPE_WIDTH 32u
#define PU_DW_APB_WDT_WDT_COMP_TYPE_WDT_COMP_TYPE_READ_ACCESS 1u
#define PU_DW_APB_WDT_WDT_COMP_TYPE_WDT_COMP_TYPE_WRITE_ACCESS 0u
#define PU_DW_APB_WDT_WDT_COMP_TYPE_WDT_COMP_TYPE_RESET 0x44570120ul
#define PU_DW_APB_WDT_WDT_COMP_TYPE_WDT_COMP_TYPE_FIELD_MASK 0xfffffffful
#define PU_DW_APB_WDT_WDT_COMP_TYPE_WDT_COMP_TYPE_GET(x) ((x) & 0xfffffffful)
#define PU_DW_APB_WDT_WDT_COMP_TYPE_WDT_COMP_TYPE_SET(x) ((x) & 0xfffffffful)
#define PU_DW_APB_WDT_WDT_COMP_TYPE_WDT_COMP_TYPE_MODIFY(r, x) \
   ((x) & 0xfffffffful)

/* ####################################################################### */
/*        TYPE DEFINITIONS                                                 */
/* ####################################################################### */

/* Typedef for Addressmap: pu_DW_apb_wdt                                   */
/* Source filename: pu_wdt.csr, line: 824                                  */
typedef struct {
   volatile uint32_t WDT_CR; /**< Offset 0x0 (R/W) */
   volatile uint32_t WDT_TORR; /**< Offset 0x4 (R/W) */
   uint32_t WDT_CCVR; /**< Offset 0x8 (R) */
   volatile uint32_t WDT_CRR; /**< Offset 0xc (W) */
   uint32_t WDT_STAT; /**< Offset 0x10 (R) */
   uint32_t WDT_EOI; /**< Offset 0x14 (R) */
   uint8_t _pad0[0xcc];
   uint32_t WDT_COMP_PARAM_5; /**< Offset 0xe4 (R) */
   uint32_t WDT_COMP_PARAM_4; /**< Offset 0xe8 (R) */
   uint32_t WDT_COMP_PARAM_3; /**< Offset 0xec (R) */
   uint32_t WDT_COMP_PARAM_2; /**< Offset 0xf0 (R) */
   uint32_t WDT_COMP_PARAM_1; /**< Offset 0xf4 (R) */
   uint32_t WDT_COMP_VERSION; /**< Offset 0xf8 (R) */
   uint32_t WDT_COMP_TYPE; /**< Offset 0xfc (R) */
} Pu_DW_apb_wdt, *PTR_Pu_DW_apb_wdt;

#endif
