/* Copyright (C) 2021, Esperanto Technologies Inc.                         */
/* The copyright to the computer program(s) herein is the                  */
/* property of Esperanto Technologies, Inc. All Rights Reserved.           */
/* The program(s) may be used and/or copied only with                      */
/* the written permission of Esperanto Technologies and                    */
/* in accordance with the terms and conditions stipulated in the           */
/* agreement/contract under which the program(s) have been supplied.       */
/*                                                                         */
/*                                                                         */
/* Generated by Semifore, Inc. csrCompile                                  */
/*    C Header output                                                      */

#ifndef _PU_UART_H_
#define _PU_UART_H_


/* ####################################################################### */
/*        ENUMERATION MACROS                                               */
/* ####################################################################### */

/* Enumeration: uart::CPR::ADDITIONAL_FEAT::ADDITIONAL_FEAT                */
#define UART_CPR_ADDITIONAL_FEAT_ADDITIONAL_FEAT_DISABLED 0x0u
#define UART_CPR_ADDITIONAL_FEAT_ADDITIONAL_FEAT_ENABLED 0x1u

/* Enumeration: uart::CPR::AFCE_MODE::AFCE_MODE                            */
#define UART_CPR_AFCE_MODE_AFCE_MODE_DISABLED 0x0u

#define UART_CPR_RSVD_CPR_3TO2_MSB 3u
#define UART_CPR_RSVD_CPR_3TO2_LSB 2u
#define UART_CPR_RSVD_CPR_3TO2_WIDTH 2u
#define UART_CPR_RSVD_CPR_3TO2_READ_ACCESS 1u
#define UART_CPR_RSVD_CPR_3TO2_WRITE_ACCESS 0u
#define UART_CPR_RSVD_CPR_3TO2_RESET 0x0u
#define UART_CPR_RSVD_CPR_3TO2_FIELD_MASK 0x0000000cul
#define UART_CPR_RSVD_CPR_3TO2_GET(x) (((x) & 0x0000000cul) >> 2)
#define UART_CPR_RSVD_CPR_3TO2_SET(x) (((x) << 2) & 0x0000000cul)
#define UART_CPR_RSVD_CPR_3TO2_MODIFY(r, x) \
   ((((x) << 2) & 0x0000000cul) | ((r) & 0xfffffff3ul))
/* Field member: uart::CPR.APB_DATA_WIDTH                                  */
#define UART_CPR_APB_DATA_WIDTH_MSB 1u
#define UART_CPR_APB_DATA_WIDTH_LSB 0u
#define UART_CPR_APB_DATA_WIDTH_WIDTH 2u
#define UART_CPR_APB_DATA_WIDTH_READ_ACCESS 1u
#define UART_CPR_APB_DATA_WIDTH_WRITE_ACCESS 0u
#define UART_CPR_APB_DATA_WIDTH_RESET 0x2u
#define UART_CPR_APB_DATA_WIDTH_FIELD_MASK 0x00000003ul
#define UART_CPR_APB_DATA_WIDTH_GET(x) ((x) & 0x00000003ul)
#define UART_CPR_APB_DATA_WIDTH_SET(x) ((x) & 0x00000003ul)
#define UART_CPR_APB_DATA_WIDTH_MODIFY(r, x) \
   (((x) & 0x00000003ul) | ((r) & 0xfffffffcul))

/* Register type: uart::UCV                                                */
/* Register template: uart::UCV                                            */
/* Field member: uart::UCV.UART_Component_Version                          */
#define UART_UCV_UART_COMPONENT_VERSION_MSB 31u
#define UART_UCV_UART_COMPONENT_VERSION_LSB 0u
#define UART_UCV_UART_COMPONENT_VERSION_WIDTH 32u
#define UART_UCV_UART_COMPONENT_VERSION_READ_ACCESS 1u
#define UART_UCV_UART_COMPONENT_VERSION_WRITE_ACCESS 0u
#define UART_UCV_UART_COMPONENT_VERSION_RESET 0x3430322aul
#define UART_UCV_UART_COMPONENT_VERSION_FIELD_MASK 0xfffffffful
#define UART_UCV_UART_COMPONENT_VERSION_GET(x) ((x) & 0xfffffffful)
#define UART_UCV_UART_COMPONENT_VERSION_SET(x) ((x) & 0xfffffffful)
#define UART_UCV_UART_COMPONENT_VERSION_MODIFY(r, x) ((x) & 0xfffffffful)

/* Register type: uart::CTR                                                */
/* Register template: uart::CTR                                            */
/* Field member: uart::CTR.Peripheral_ID                                   */
#define UART_CTR_PERIPHERAL_ID_MSB 31u
#define UART_CTR_PERIPHERAL_ID_LSB 0u
#define UART_CTR_PERIPHERAL_ID_WIDTH 32u
#define UART_CTR_PERIPHERAL_ID_READ_ACCESS 1u
#define UART_CTR_PERIPHERAL_ID_WRITE_ACCESS 0u
#define UART_CTR_PERIPHERAL_ID_RESET 0x44570110ul
#define UART_CTR_PERIPHERAL_ID_FIELD_MASK 0xfffffffful
#define UART_CTR_PERIPHERAL_ID_GET(x) ((x) & 0xfffffffful)
#define UART_CTR_PERIPHERAL_ID_SET(x) ((x) & 0xfffffffful)
#define UART_CTR_PERIPHERAL_ID_MODIFY(r, x) ((x) & 0xfffffffful)

/* ####################################################################### */
/*        TYPE DEFINITIONS                                                 */
/* ####################################################################### */

/* Typedef for Union: uart::RBR                                            */
typedef union {
   uint32_t RBR; /**< Offset 0x0 (R) */
   volatile uint32_t DLL; /**< Offset 0x0 (R/W) */
   volatile uint32_t THR; /**< Offset 0x0 (R/W) */
} Uart_RBR, *PTR_Uart_RBR;

/* Typedef for Union: uart::IER                                            */
typedef union {
   volatile uint32_t IER; /**< Offset 0x0 (R/W) */
   volatile uint32_t DLH; /**< Offset 0x0 (R/W) */
} Uart_IER, *PTR_Uart_IER;

/* Typedef for Union: uart::IIR                                            */
typedef union {
   uint32_t IIR; /**< Offset 0x0 (R) */
   volatile uint32_t FCR; /**< Offset 0x0 (R/W) */
} Uart_IIR, *PTR_Uart_IIR;

/* Typedef for Union: uart::SRBR0                                          */
typedef union {
   uint32_t SRBR0; /**< Offset 0x0 (R) */
   volatile uint32_t STHR0; /**< Offset 0x0 (R/W) */
} Uart_SRBR0, *PTR_Uart_SRBR0;

/* Typedef for Union: uart::SRBR1                                          */
typedef union {
   uint32_t SRBR1; /**< Offset 0x0 (R) */
   volatile uint32_t STHR1; /**< Offset 0x0 (R/W) */
} Uart_SRBR1, *PTR_Uart_SRBR1;

/* Typedef for Union: uart::SRBR2                                          */
typedef union {
   uint32_t SRBR2; /**< Offset 0x0 (R) */
   volatile uint32_t STHR2; /**< Offset 0x0 (R/W) */
} Uart_SRBR2, *PTR_Uart_SRBR2;

/* Typedef for Union: uart::SRBR3                                          */
typedef union {
   uint32_t SRBR3; /**< Offset 0x0 (R) */
   volatile uint32_t STHR3; /**< Offset 0x0 (R/W) */
} Uart_SRBR3, *PTR_Uart_SRBR3;

/* Typedef for Union: uart::SRBR4                                          */
typedef union {
   uint32_t SRBR4; /**< Offset 0x0 (R) */
   volatile uint32_t STHR4; /**< Offset 0x0 (R/W) */
} Uart_SRBR4, *PTR_Uart_SRBR4;

/* Typedef for Union: uart::SRBR5                                          */
typedef union {
   uint32_t SRBR5; /**< Offset 0x0 (R) */
   volatile uint32_t STHR5; /**< Offset 0x0 (R/W) */
} Uart_SRBR5, *PTR_Uart_SRBR5;

/* Typedef for Union: uart::SRBR6                                          */
typedef union {
   uint32_t SRBR6; /**< Offset 0x0 (R) */
   volatile uint32_t STHR6; /**< Offset 0x0 (R/W) */
} Uart_SRBR6, *PTR_Uart_SRBR6;

/* Typedef for Union: uart::SRBR7                                          */
typedef union {
   uint32_t SRBR7; /**< Offset 0x0 (R) */
   volatile uint32_t STHR7; /**< Offset 0x0 (R/W) */
} Uart_SRBR7, *PTR_Uart_SRBR7;

/* Typedef for Union: uart::SRBR8                                          */
typedef union {
   uint32_t SRBR8; /**< Offset 0x0 (R) */
   volatile uint32_t STHR8; /**< Offset 0x0 (R/W) */
} Uart_SRBR8, *PTR_Uart_SRBR8;

/* Typedef for Union: uart::SRBR9                                          */
typedef union {
   uint32_t SRBR9; /**< Offset 0x0 (R) */
   volatile uint32_t STHR9; /**< Offset 0x0 (R/W) */
} Uart_SRBR9, *PTR_Uart_SRBR9;

/* Typedef for Union: uart::SRBR10                                         */
typedef union {
   uint32_t SRBR10; /**< Offset 0x0 (R) */
   volatile uint32_t STHR10; /**< Offset 0x0 (R/W) */
} Uart_SRBR10, *PTR_Uart_SRBR10;

/* Typedef for Union: uart::SRBR11                                         */
typedef union {
   uint32_t SRBR11; /**< Offset 0x0 (R) */
   volatile uint32_t STHR11; /**< Offset 0x0 (R/W) */
} Uart_SRBR11, *PTR_Uart_SRBR11;

/* Typedef for Union: uart::SRBR12                                         */
typedef union {
   uint32_t SRBR12; /**< Offset 0x0 (R) */
   volatile uint32_t STHR12; /**< Offset 0x0 (R/W) */
} Uart_SRBR12, *PTR_Uart_SRBR12;

/* Typedef for Union: uart::SRBR13                                         */
typedef union {
   uint32_t SRBR13; /**< Offset 0x0 (R) */
   volatile uint32_t STHR13; /**< Offset 0x0 (R/W) */
} Uart_SRBR13, *PTR_Uart_SRBR13;

/* Typedef for Union: uart::SRBR14                                         */
typedef union {
   uint32_t SRBR14; /**< Offset 0x0 (R) */
   volatile uint32_t STHR14; /**< Offset 0x0 (R/W) */
} Uart_SRBR14, *PTR_Uart_SRBR14;

/* Typedef for Union: uart::SRBR15                                         */
typedef union {
   uint32_t SRBR15; /**< Offset 0x0 (R) */
   volatile uint32_t STHR15; /**< Offset 0x0 (R/W) */
} Uart_SRBR15, *PTR_Uart_SRBR15;

/* Typedef for Addressmap: uart                                            */
typedef struct {
   Uart_RBR RBR; /**< Offset 0x0 (R/W) */
   Uart_IER IER; /**< Offset 0x4 (R/W) */
   Uart_IIR IIR; /**< Offset 0x8 (R/W) */
   volatile uint32_t LCR; /**< Offset 0xc (R/W) */
   volatile uint32_t MCR; /**< Offset 0x10 (R/W) */
   uint32_t LSR; /**< Offset 0x14 (R) */
   uint32_t MSR; /**< Offset 0x18 (R) */
   volatile uint32_t SCR; /**< Offset 0x1c (R/W) */
   uint8_t _pad0[0x10];
   Uart_SRBR0 SRBR0; /**< Offset 0x30 (R/W) */
   Uart_SRBR1 SRBR1; /**< Offset 0x34 (R/W) */
   Uart_SRBR2 SRBR2; /**< Offset 0x38 (R/W) */
   Uart_SRBR3 SRBR3; /**< Offset 0x3c (R/W) */
   Uart_SRBR4 SRBR4; /**< Offset 0x40 (R/W) */
   Uart_SRBR5 SRBR5; /**< Offset 0x44 (R/W) */
   Uart_SRBR6 SRBR6; /**< Offset 0x48 (R/W) */
   Uart_SRBR7 SRBR7; /**< Offset 0x4c (R/W) */
   Uart_SRBR8 SRBR8; /**< Offset 0x50 (R/W) */
   Uart_SRBR9 SRBR9; /**< Offset 0x54 (R/W) */
   Uart_SRBR10 SRBR10; /**< Offset 0x58 (R/W) */
   Uart_SRBR11 SRBR11; /**< Offset 0x5c (R/W) */
   Uart_SRBR12 SRBR12; /**< Offset 0x60 (R/W) */
   Uart_SRBR13 SRBR13; /**< Offset 0x64 (R/W) */
   Uart_SRBR14 SRBR14; /**< Offset 0x68 (R/W) */
   Uart_SRBR15 SRBR15; /**< Offset 0x6c (R/W) */
   volatile uint32_t FAR; /**< Offset 0x70 (R/W) */
   uint32_t TFR; /**< Offset 0x74 (R) */
   volatile uint32_t RFW; /**< Offset 0x78 (R/W) */
   uint32_t USR; /**< Offset 0x7c (R) */
   uint32_t TFL; /**< Offset 0x80 (R) */
   uint32_t RFL; /**< Offset 0x84 (R) */
   volatile uint32_t SRR; /**< Offset 0x88 (R/W) */
   volatile uint32_t SRTS; /**< Offset 0x8c (R/W) */
   volatile uint32_t SBCR; /**< Offset 0x90 (R/W) */
   volatile uint32_t SDMAM; /**< Offset 0x94 (R/W) */
   volatile uint32_t SFE; /**< Offset 0x98 (R/W) */
   volatile uint32_t SRT; /**< Offset 0x9c (R/W) */
   volatile uint32_t STET; /**< Offset 0xa0 (R/W) */
   volatile uint32_t HTX; /**< Offset 0xa4 (R/W) */
   uint32_t DMASA; /**< Offset 0xa8 (R) */
   uint8_t _pad1[0x14];
   volatile uint32_t DLF; /**< Offset 0xc0 (R/W) */
   uint8_t _pad2[0x10];
   volatile uint32_t REG_TIMEOUT_RST; /**< Offset 0xd4 (R/W) */
   uint8_t _pad3[0x1c];
   uint32_t CPR; /**< Offset 0xf4 (R) */
   uint32_t UCV; /**< Offset 0xf8 (R) */
   uint32_t CTR; /**< Offset 0xfc (R) */
   uint8_t _pad4[0x300];
} Uart, *PTR_Uart;

#endif
