/* Copyright (c) 2025 Ainekko, Co. */
/* SPDX-License-Identifier: Apache-2.0 */
/*                                                                         */
/*                                                                         */
/* Generated by Semifore, Inc. csrCompile                                  */
/*    C Header output                                                      */

#ifndef _SP_WDT_H_
#define _SP_WDT_H_


/* ####################################################################### */
/*        ENUMERATION MACROS                                               */
/* ####################################################################### */

/* Enumeration: wdt::WDT_COMP_PARAM_1::APB_DATA_WIDTH::APB_DATA_WIDTH      */
#define WDT_WDT_COMP_PARAM_1_APB_DATA_WIDTH_APB_DATA_WIDTH_APB_16BITS 0x1u
#define WDT_WDT_COMP_PARAM_1_APB_DATA_WIDTH_APB_DATA_WIDTH_APB_32BITS 0x2u
#define WDT_WDT_COMP_PARAM_1_APB_DATA_WIDTH_APB_DATA_WIDTH_APB_8BITS 0x0u

/* Enumeration: wdt::WDT_COMP_PARAM_1::WDT_ALWAYS_EN::WDT_ALWAYS_EN        */
#define WDT_WDT_COMP_PARAM_1_WDT_ALWAYS_EN_WDT_ALWAYS_EN_DISABLED 0x0u
#define WDT_WDT_COMP_PARAM_1_WDT_ALWAYS_EN_WDT_ALWAYS_EN_ENABLED 0x1u

/* Enumeration: wdt::WDT_COMP_PARAM_1::WDT_DFLT_RMOD::WDT_DFLT_RMOD        */
#define WDT_WDT_COMP_PARAM_1_WDT_DFLT_RMOD_WDT_DFLT_RMOD_DISABLED 0x0u
#define WDT_WDT_COMP_PARAM_1_WDT_DFLT_RMOD_WDT_DFLT_RMOD_ENABLED 0x1u

/* Enumeration: wdt::WDT_COMP_PARAM_1::WDT_DUAL_TOP::WDT_DUAL_TOP          */

#define WDT_WDT_COMP_PARAM_1_WDT_DFLT_RMOD_GET(x) (((x) & 0x00000002ul) >> 1)
#define WDT_WDT_COMP_PARAM_1_WDT_DFLT_RMOD_SET(x) \
   (((x) << 1) & 0x00000002ul)
#define WDT_WDT_COMP_PARAM_1_WDT_DFLT_RMOD_MODIFY(r, x) \
   ((((x) << 1) & 0x00000002ul) | ((r) & 0xfffffffdul))
/* Field member: wdt::WDT_COMP_PARAM_1.WDT_ALWAYS_EN                       */
#define WDT_WDT_COMP_PARAM_1_WDT_ALWAYS_EN_MSB 0u
#define WDT_WDT_COMP_PARAM_1_WDT_ALWAYS_EN_LSB 0u
#define WDT_WDT_COMP_PARAM_1_WDT_ALWAYS_EN_WIDTH 1u
#define WDT_WDT_COMP_PARAM_1_WDT_ALWAYS_EN_READ_ACCESS 1u
#define WDT_WDT_COMP_PARAM_1_WDT_ALWAYS_EN_WRITE_ACCESS 0u
#define WDT_WDT_COMP_PARAM_1_WDT_ALWAYS_EN_RESET 0x0u
#define WDT_WDT_COMP_PARAM_1_WDT_ALWAYS_EN_FIELD_MASK 0x00000001ul
#define WDT_WDT_COMP_PARAM_1_WDT_ALWAYS_EN_GET(x) ((x) & 0x00000001ul)
#define WDT_WDT_COMP_PARAM_1_WDT_ALWAYS_EN_SET(x) ((x) & 0x00000001ul)
#define WDT_WDT_COMP_PARAM_1_WDT_ALWAYS_EN_MODIFY(r, x) \
   (((x) & 0x00000001ul) | ((r) & 0xfffffffeul))

/* Register type: wdt::WDT_COMP_VERSION                                    */
/* Register template: wdt::WDT_COMP_VERSION                                */
/* Field member: wdt::WDT_COMP_VERSION.WDT_COMP_VERSION                    */
#define WDT_WDT_COMP_VERSION_WDT_COMP_VERSION_MSB 31u
#define WDT_WDT_COMP_VERSION_WDT_COMP_VERSION_LSB 0u
#define WDT_WDT_COMP_VERSION_WDT_COMP_VERSION_WIDTH 32u
#define WDT_WDT_COMP_VERSION_WDT_COMP_VERSION_READ_ACCESS 1u
#define WDT_WDT_COMP_VERSION_WDT_COMP_VERSION_WRITE_ACCESS 0u
#define WDT_WDT_COMP_VERSION_WDT_COMP_VERSION_RESET 0x3131312aul
#define WDT_WDT_COMP_VERSION_WDT_COMP_VERSION_FIELD_MASK 0xfffffffful
#define WDT_WDT_COMP_VERSION_WDT_COMP_VERSION_GET(x) ((x) & 0xfffffffful)
#define WDT_WDT_COMP_VERSION_WDT_COMP_VERSION_SET(x) ((x) & 0xfffffffful)
#define WDT_WDT_COMP_VERSION_WDT_COMP_VERSION_MODIFY(r, x) \
   ((x) & 0xfffffffful)

/* Register type: wdt::WDT_COMP_TYPE                                       */
/* Register template: wdt::WDT_COMP_TYPE                                   */
/* Field member: wdt::WDT_COMP_TYPE.WDT_COMP_TYPE                          */
#define WDT_WDT_COMP_TYPE_WDT_COMP_TYPE_MSB 31u
#define WDT_WDT_COMP_TYPE_WDT_COMP_TYPE_LSB 0u
#define WDT_WDT_COMP_TYPE_WDT_COMP_TYPE_WIDTH 32u
#define WDT_WDT_COMP_TYPE_WDT_COMP_TYPE_READ_ACCESS 1u
#define WDT_WDT_COMP_TYPE_WDT_COMP_TYPE_WRITE_ACCESS 0u
#define WDT_WDT_COMP_TYPE_WDT_COMP_TYPE_RESET 0x44570120ul
#define WDT_WDT_COMP_TYPE_WDT_COMP_TYPE_FIELD_MASK 0xfffffffful
#define WDT_WDT_COMP_TYPE_WDT_COMP_TYPE_GET(x) ((x) & 0xfffffffful)
#define WDT_WDT_COMP_TYPE_WDT_COMP_TYPE_SET(x) ((x) & 0xfffffffful)
#define WDT_WDT_COMP_TYPE_WDT_COMP_TYPE_MODIFY(r, x) ((x) & 0xfffffffful)

/* ####################################################################### */
/*        TYPE DEFINITIONS                                                 */
/* ####################################################################### */

/* Typedef for Addressmap: wdt                                             */
typedef struct {
   volatile uint32_t WDT_CR; /**< Offset 0x0 (R/W) */
   volatile uint32_t WDT_TORR; /**< Offset 0x4 (R/W) */
   uint32_t WDT_CCVR; /**< Offset 0x8 (R) */
   volatile uint32_t WDT_CRR; /**< Offset 0xc (W) */
   uint32_t WDT_STAT; /**< Offset 0x10 (R) */
   uint32_t WDT_EOI; /**< Offset 0x14 (R) */
   uint8_t _pad0[0xcc];
   uint32_t WDT_COMP_PARAM_5; /**< Offset 0xe4 (R) */
   uint32_t WDT_COMP_PARAM_4; /**< Offset 0xe8 (R) */
   uint32_t WDT_COMP_PARAM_3; /**< Offset 0xec (R) */
   uint32_t WDT_COMP_PARAM_2; /**< Offset 0xf0 (R) */
   uint32_t WDT_COMP_PARAM_1; /**< Offset 0xf4 (R) */
   uint32_t WDT_COMP_VERSION; /**< Offset 0xf8 (R) */
   uint32_t WDT_COMP_TYPE; /**< Offset 0xfc (R) */
   uint8_t _pad1[0xf00];
} Wdt, *PTR_Wdt;

#endif
