/*                                                                         */
/* Generated by Semifore, Inc. csrCompile                                  */
/*    Version: 2019.03.01 Build: release Linux 64-bit                      */
/*    C Header output                                                      */
/*                                                                         */
/* Command Line:                                                           */
/*    /home/cad/tools/semifore/csrCompile/LATEST/bin/x64_re6/csrCompile -v */
/*    -c                                                                   */
/*    /data/ssmith/work/repos/soc_hal/dv/common/scripts/semifore_css/bitfield_enum_doc.css */
/*    -t h mvls_tn7_hpdpll.ipxact.csr -o gen_sw/mvls_tn7_hpdpll.ipxact     */
/*                                                                         */
/* Input files:                                                            */
/*    mvls_tn7_hpdpll.ipxact.csr                                           */
/*                                                                         */
/* Configuration files:                                                    */
/*    /data/ssmith/work/repos/soc_hal/dv/common/scripts/semifore_css/bitfield_enum_doc.css */
/*                                                                         */
/* Generated on: Tue May 21 15:34:18 2019                                  */
/*           by: ssmith                                                    */
/*                                                                         */

#ifndef _MVLS_TN7_HPDPLL_IPXACT_H_
#define _MVLS_TN7_HPDPLL_IPXACT_H_


/* ####################################################################### */
/*        TYPE DEFINITIONS                                                 */
/* ####################################################################### */

/* Typedef for Register: mvls_tn7_hpdpll_MAIN::MAIN::Register0             */
/* Source filename: mvls_tn7_hpdpll.ipxact.csr, line: 24                   */
/* Description:                                                            */
/**
 *    Contains field values for: clkref_select, clkref_select_reserved, 
 *    clkpll_bypass, pll_enable, lock_timeout_enable, clkref_switch_enable, 
 *    dlf_enable, dco_normalization_enable, freq_acq_enable, dsm_enable, 
 *    dsm_dither_enable, open_loop_bypass_enable, postdiv_sync_reserved, 
 *    clkfb_phase_alignment_enable_reserved, clkfb_select_reserved, 
 *    dynamic_normalization_enable.
*/
typedef struct {
   union {
      struct {

         /* Source filename: mvls_tn7_hpdpll.ipxact.csr, line: 33          */
         /* Description:                                                   */
         /**
          *    3 reference sources
         */
         uint16_t clkref_select : 1; /* bit 0; R/W */

         /* Source filename: mvls_tn7_hpdpll.ipxact.csr, line: 38          */
         uint16_t clkref_select_reserved : 1; /* bit 1; R */

         /* Source filename: mvls_tn7_hpdpll.ipxact.csr, line: 42          */
         uint16_t clkpll_bypass : 1; /* bit 2; R/W */

         /* Source filename: mvls_tn7_hpdpll.ipxact.csr, line: 45          */
         uint16_t pll_enable : 1; /* bit 3; R/W */

         /* Source filename: mvls_tn7_hpdpll.ipxact.csr, line: 48          */
         uint16_t lock_timeout_enable : 1; /* bit 4; R/W */

         /* Source filename: mvls_tn7_hpdpll.ipxact.csr, line: 51          */
         uint16_t clkref_switch_enable : 1; /* bit 5; R/W */

         /* Source filename: mvls_tn7_hpdpll.ipxact.csr, line: 54          */
         /* Description:                                                   */
         /**
          *    dynamic loop filter enable
         */
         uint16_t dlf_enable : 1; /* bit 6; R/W */

         /* Source filename: mvls_tn7_hpdpll.ipxact.csr, line: 59          */
         uint16_t dco_normalization_enable : 1; /* bit 7; R/W */

         /* Source filename: mvls_tn7_hpdpll.ipxact.csr, line: 62          */
         uint16_t freq_acq_enable : 1; /* bit 8; R/W */

         /* Source filename: mvls_tn7_hpdpll.ipxact.csr, line: 65          */
         uint16_t dsm_enable : 1; /* bit 9; R/W */

         /* Source filename: mvls_tn7_hpdpll.ipxact.csr, line: 68          */
         uint16_t dsm_dither_enable : 1; /* bit 10; R/W */

         /* Source filename: mvls_tn7_hpdpll.ipxact.csr, line: 71          */
         uint16_t open_loop_bypass_enable : 1; /* bit 11; R/W */

         /* Source filename: mvls_tn7_hpdpll.ipxact.csr, line: 74          */
         uint16_t postdiv_sync_reserved : 1; /* bit 12; R */

         /* Source filename: mvls_tn7_hpdpll.ipxact.csr, line: 78          */
         uint16_t clkfb_phase_alignment_enable_reserved : 1; /* bit 13; R */

         /* Source filename: mvls_tn7_hpdpll.ipxact.csr, line: 82          */
         uint16_t clkfb_select_reserved : 1; /* bit 14; R */

         /* Source filename: mvls_tn7_hpdpll.ipxact.csr, line: 86          */
         uint16_t dynamic_normalization_enable : 1; /* bit 15; R/W */
      } B;
      uint16_t word;
   } ;
} Mvls_tn7_hpdpll_MAIN_MAIN_Register0_t;

/* Typedef for Register: mvls_tn7_hpdpll_MAIN::MAIN::Register1             */
/* Source filename: mvls_tn7_hpdpll.ipxact.csr, line: 90                   */
/* Description:                                                            */
/**
 *    Contains field values for: fcw_prediv.
*/
typedef struct {
   union {
      struct {

         /* Source filename: mvls_tn7_hpdpll.ipxact.csr, line: 93          */
         /* Description:                                                   */
         /**
          *    1..512
         */
         uint16_t fcw_prediv : 9; /* bits 8 to 0; R/W */
         uint16_t : 7; /* bits 15 to 9 */
      } B;
      uint16_t word;
   } ;
} Mvls_tn7_hpdpll_MAIN_MAIN_Register1_t;

/* Typedef for Register: mvls_tn7_hpdpll_MAIN::MAIN::Register2             */
/* Source filename: mvls_tn7_hpdpll.ipxact.csr, line: 99                   */
/* Description:                                                            */
/**
 *    Contains field values for: fcw_int.
*/
typedef struct {
   union {
      struct {

         /* Source filename: mvls_tn7_hpdpll.ipxact.csr, line: 102         */
         /* Description:                                                   */
         /**
          *    1..1023
         */
         uint16_t fcw_int : 10; /* bits 9 to 0; R/W */
         uint16_t : 6; /* bits 15 to 10 */
      } B;
      uint16_t word;
   } ;
} Mvls_tn7_hpdpll_MAIN_MAIN_Register2_t;

/* Typedef for Register: mvls_tn7_hpdpll_MAIN::MAIN::Register3             */
/* Source filename: mvls_tn7_hpdpll.ipxact.csr, line: 108                  */
/* Description:                                                            */
/**
 *    Contains field values for: fcw_frac.
*/
typedef struct {
   union {
      struct {

         /* Source filename: mvls_tn7_hpdpll.ipxact.csr, line: 111         */
         uint16_t fcw_frac : 16; /* bits 15 to 0; R/W */
      } B;
      uint16_t word;
   } ;
} Mvls_tn7_hpdpll_MAIN_MAIN_Register3_t;

/* Typedef for Register: mvls_tn7_hpdpll_MAIN::MAIN::Register4             */
/* Source filename: mvls_tn7_hpdpll.ipxact.csr, line: 115                  */
/* Description:                                                            */
/**
 *    Contains field values for: dlf_locked_kp.
*/
typedef struct {
   union {
      struct {

         /* Source filename: mvls_tn7_hpdpll.ipxact.csr, line: 118         */
         /* Description:                                                   */
         /**
          *    u6.8
         */
         uint16_t dlf_locked_kp : 14; /* bits 13 to 0; R/W */
         uint16_t : 2; /* bits 15 to 14 */
      } B;
      uint16_t word;
   } ;
} Mvls_tn7_hpdpll_MAIN_MAIN_Register4_t;

/* Typedef for Register: mvls_tn7_hpdpll_MAIN::MAIN::Register5             */
/* Source filename: mvls_tn7_hpdpll.ipxact.csr, line: 124                  */
/* Description:                                                            */
/**
 *    Contains field values for: dlf_locked_ki.
*/
typedef struct {
   union {
      struct {

         /* Source filename: mvls_tn7_hpdpll.ipxact.csr, line: 127         */
         /* Description:                                                   */
         /**
          *    u4.10
         */
         uint16_t dlf_locked_ki : 14; /* bits 13 to 0; R/W */
         uint16_t : 2; /* bits 15 to 14 */
      } B;
      uint16_t word;
   } ;
} Mvls_tn7_hpdpll_MAIN_MAIN_Register5_t;

/* Typedef for Register: mvls_tn7_hpdpll_MAIN::MAIN::Register6             */
/* Source filename: mvls_tn7_hpdpll.ipxact.csr, line: 133                  */
/* Description:                                                            */
/**
 *    Contains field values for: dlf_locked_kb.
*/
typedef struct {
   union {
      struct {

         /* Source filename: mvls_tn7_hpdpll.ipxact.csr, line: 136         */
         /* Description:                                                   */
         /**
          *    u1.13
         */
         uint16_t dlf_locked_kb : 14; /* bits 13 to 0; R/W */
         uint16_t : 2; /* bits 15 to 14 */
      } B;
      uint16_t word;
   } ;
} Mvls_tn7_hpdpll_MAIN_MAIN_Register6_t;

/* Typedef for Register: mvls_tn7_hpdpll_MAIN::MAIN::Register7             */
/* Source filename: mvls_tn7_hpdpll.ipxact.csr, line: 142                  */
/* Description:                                                            */
/**
 *    Contains field values for: dlf_track_kp.
*/
typedef struct {
   union {
      struct {

         /* Source filename: mvls_tn7_hpdpll.ipxact.csr, line: 145         */
         /* Description:                                                   */
         /**
          *    u6.8
         */
         uint16_t dlf_track_kp : 14; /* bits 13 to 0; R/W */
         uint16_t : 2; /* bits 15 to 14 */
      } B;
      uint16_t word;
   } ;
} Mvls_tn7_hpdpll_MAIN_MAIN_Register7_t;

/* Typedef for Register: mvls_tn7_hpdpll_MAIN::MAIN::Register8             */
/* Source filename: mvls_tn7_hpdpll.ipxact.csr, line: 151                  */
/* Description:                                                            */
/**
 *    Contains field values for: dlf_track_ki.
*/
typedef struct {
   union {
      struct {

         /* Source filename: mvls_tn7_hpdpll.ipxact.csr, line: 154         */
         /* Description:                                                   */
         /**
          *    u4.10
         */
         uint16_t dlf_track_ki : 14; /* bits 13 to 0; R/W */
         uint16_t : 2; /* bits 15 to 14 */
      } B;
      uint16_t word;
   } ;
} Mvls_tn7_hpdpll_MAIN_MAIN_Register8_t;

/* Typedef for Register: mvls_tn7_hpdpll_MAIN::MAIN::Register9             */
/* Source filename: mvls_tn7_hpdpll.ipxact.csr, line: 160                  */
/* Description:                                                            */
/**
 *    Contains field values for: dlf_track_kb.
*/
typedef struct {
   union {
      struct {

         /* Source filename: mvls_tn7_hpdpll.ipxact.csr, line: 163         */
         /* Description:                                                   */
         /**
          *    u1.13
         */
         uint16_t dlf_track_kb : 14; /* bits 13 to 0; R/W */
         uint16_t : 2; /* bits 15 to 14 */
      } B;
      uint16_t word;
   } ;
} Mvls_tn7_hpdpll_MAIN_MAIN_Register9_t;

/* Typedef for Register: mvls_tn7_hpdpll_MAIN::MAIN::Register10            */
/* Source filename: mvls_tn7_hpdpll.ipxact.csr, line: 169                  */
/* Description:                                                            */
/**
 *    Contains field values for: lock_count, fcw_lol.
*/
typedef struct {
   union {
      struct {

         /* Source filename: mvls_tn7_hpdpll.ipxact.csr, line: 172         */
         uint16_t lock_count : 8; /* bits 7 to 0; R/W */

         /* Source filename: mvls_tn7_hpdpll.ipxact.csr, line: 175         */
         /* Description:                                                   */
         /**
          *    force loss of lock on FCW change
         */
         uint16_t fcw_lol : 1; /* bit 8; R/W */
         uint16_t : 7; /* bits 15 to 9 */
      } B;
      uint16_t word;
   } ;
} Mvls_tn7_hpdpll_MAIN_MAIN_Register10_t;

/* Typedef for Register: mvls_tn7_hpdpll_MAIN::MAIN::Register11            */
/* Source filename: mvls_tn7_hpdpll.ipxact.csr, line: 181                  */
/* Description:                                                            */
/**
 *    Contains field values for: lock_threshold.
*/
typedef struct {
   union {
      struct {

         /* Source filename: mvls_tn7_hpdpll.ipxact.csr, line: 184         */
         uint16_t lock_threshold : 16; /* bits 15 to 0; R/W */
      } B;
      uint16_t word;
   } ;
} Mvls_tn7_hpdpll_MAIN_MAIN_Register11_t;

/* Typedef for Register: mvls_tn7_hpdpll_MAIN::MAIN::Register12            */
/* Source filename: mvls_tn7_hpdpll.ipxact.csr, line: 188                  */
/* Description:                                                            */
/**
 *    Contains field values for: dco_gain_fref.
*/
typedef struct {
   union {
      struct {

         /* Source filename: mvls_tn7_hpdpll.ipxact.csr, line: 191         */
         uint16_t dco_gain_fref : 12; /* bits 11 to 0; R/W */
         uint16_t : 4; /* bits 15 to 12 */
      } B;
      uint16_t word;
   } ;
} Mvls_tn7_hpdpll_MAIN_MAIN_Register12_t;

/* Typedef for Register: mvls_tn7_hpdpll_MAIN::MAIN::Register13            */
/* Source filename: mvls_tn7_hpdpll.ipxact.csr, line: 195                  */
/* Description:                                                            */
/**
 *    Contains field values for: dsm_dither_position, dsm_dither_width, 
 *    dsm_shift.
*/
typedef struct {
   union {
      struct {

         /* Source filename: mvls_tn7_hpdpll.ipxact.csr, line: 199         */
         uint16_t dsm_dither_position : 4; /* bits 3 to 0; R/W */

         /* Source filename: mvls_tn7_hpdpll.ipxact.csr, line: 202         */
         /* Description:                                                   */
         /**
          *    1..3
         */
         uint16_t dsm_dither_width : 2; /* bits 5 to 4; R/W */

         /* Source filename: mvls_tn7_hpdpll.ipxact.csr, line: 207         */
         /* Description:                                                   */
         /**
          *    0..3
         */
         uint16_t dsm_shift : 2; /* bits 7 to 6; R/W */
         uint16_t : 8; /* bits 15 to 8 */
      } B;
      uint16_t word;
   } ;
} Mvls_tn7_hpdpll_MAIN_MAIN_Register13_t;

/* Typedef for Register: mvls_tn7_hpdpll_MAIN::MAIN::Register14            */
/* Source filename: mvls_tn7_hpdpll.ipxact.csr, line: 213                  */
/* Description:                                                            */
/**
 *    Contains field values for: postdiv0.
*/
typedef struct {
   union {
      struct {

         /* Source filename: mvls_tn7_hpdpll.ipxact.csr, line: 216         */
         /* Description:                                                   */
         /**
          *    1..128
         */
         uint16_t postdiv0 : 9; /* bits 8 to 0; R/W */
         uint16_t : 7; /* bits 15 to 9 */
      } B;
      uint16_t word;
   } ;
} Mvls_tn7_hpdpll_MAIN_MAIN_Register14_t;

/* Typedef for Register: mvls_tn7_hpdpll_MAIN::MAIN::Register15            */
/* Source filename: mvls_tn7_hpdpll.ipxact.csr, line: 222                  */
/* Description:                                                            */
/**
 *    Contains field values for: postdiv0_powerdown, postdiv0_bypass_enable, 
 *    postdiv0_bypass_clksel.
*/
typedef struct {
   union {
      struct {

         /* Source filename: mvls_tn7_hpdpll.ipxact.csr, line: 226         */
         /* Description:                                                   */
         /**
          *    1 to powerdown clock
         */
         uint16_t postdiv0_powerdown : 1; /* bit 0; R/W */

         /* Source filename: mvls_tn7_hpdpll.ipxact.csr, line: 231         */
         /* Description:                                                   */
         /**
          *    1 to bypass postdivider
         */
         uint16_t postdiv0_bypass_enable : 1; /* bit 1; R/W */

         /* Source filename: mvls_tn7_hpdpll.ipxact.csr, line: 236         */
         uint16_t postdiv0_bypass_clksel : 1; /* bit 2; R/W */
         uint16_t : 13; /* bits 15 to 3 */
      } B;
      uint16_t word;
   } ;
} Mvls_tn7_hpdpll_MAIN_MAIN_Register15_t;

/* Typedef for Register: mvls_tn7_hpdpll_MAIN::MAIN::Register16            */
/* Source filename: mvls_tn7_hpdpll.ipxact.csr, line: 240                  */
/* Description:                                                            */
/**
 *    Contains field values for: reserved.
*/
typedef struct {
   union {
      struct {

         /* Source filename: mvls_tn7_hpdpll.ipxact.csr, line: 243         */
         uint16_t reserved : 16; /* bits 15 to 0; R */
      } B;
      uint16_t word;
   } ;
} Mvls_tn7_hpdpll_MAIN_MAIN_Register16_t;

/* Typedef for Register: mvls_tn7_hpdpll_MAIN::MAIN::Register22            */
/* Source filename: mvls_tn7_hpdpll.ipxact.csr, line: 248                  */
/* Description:                                                            */
/**
 *    Contains field values for: open_loop_code.
*/
typedef struct {
   union {
      struct {

         /* Source filename: mvls_tn7_hpdpll.ipxact.csr, line: 251         */
         uint16_t open_loop_code : 11; /* bits 10 to 0; R/W */
         uint16_t : 5; /* bits 15 to 11 */
      } B;
      uint16_t word;
   } ;
} Mvls_tn7_hpdpll_MAIN_MAIN_Register22_t;

/* Typedef for Register: mvls_tn7_hpdpll_MAIN::MAIN::Register23            */
/* Source filename: mvls_tn7_hpdpll.ipxact.csr, line: 255                  */
/* Description:                                                            */
/**
 *    Contains field values for: ldo_bypass, ldo_power_down, ldo_ref_trim, 
 *    ldo_tc_trim, ldo_test.
*/
typedef struct {
   union {
      struct {

         /* Source filename: mvls_tn7_hpdpll.ipxact.csr, line: 259         */
         uint16_t ldo_bypass : 1; /* bit 0; R/W */

         /* Source filename: mvls_tn7_hpdpll.ipxact.csr, line: 262         */
         uint16_t ldo_power_down : 1; /* bit 1; R/W */

         /* Source filename: mvls_tn7_hpdpll.ipxact.csr, line: 265         */
         uint16_t ldo_ref_trim : 4; /* bits 5 to 2; R/W */

         /* Source filename: mvls_tn7_hpdpll.ipxact.csr, line: 268         */
         uint16_t ldo_tc_trim : 2; /* bits 7 to 6; R/W */

         /* Source filename: mvls_tn7_hpdpll.ipxact.csr, line: 271         */
         uint16_t ldo_test : 2; /* bits 9 to 8; R/W */
         uint16_t : 6; /* bits 15 to 10 */
      } B;
      uint16_t word;
   } ;
} Mvls_tn7_hpdpll_MAIN_MAIN_Register23_t;

/* Typedef for Register: mvls_tn7_hpdpll_MAIN::MAIN::Register24            */
/* Source filename: mvls_tn7_hpdpll.ipxact.csr, line: 275                  */
/* Description:                                                            */
/**
 *    Contains field values for: ldo_reserved0.
*/
typedef struct {
   union {
      struct {

         /* Source filename: mvls_tn7_hpdpll.ipxact.csr, line: 278         */
         uint16_t ldo_reserved0 : 16; /* bits 15 to 0; R */
      } B;
      uint16_t word;
   } ;
} Mvls_tn7_hpdpll_MAIN_MAIN_Register24_t;

/* Typedef for Register: mvls_tn7_hpdpll_MAIN::MAIN::Register25            */
/* Source filename: mvls_tn7_hpdpll.ipxact.csr, line: 283                  */
/* Description:                                                            */
/**
 *    Contains field values for: ldo_reserved1.
*/
typedef struct {
   union {
      struct {

         /* Source filename: mvls_tn7_hpdpll.ipxact.csr, line: 286         */
         uint16_t ldo_reserved1 : 16; /* bits 15 to 0; R */
      } B;
      uint16_t word;
   } ;
} Mvls_tn7_hpdpll_MAIN_MAIN_Register25_t;

/* Typedef for Register: mvls_tn7_hpdpll_MAIN::MAIN::Register26            */
/* Source filename: mvls_tn7_hpdpll.ipxact.csr, line: 291                  */
/* Description:                                                            */
/**
 *    Contains field values for: ldo_reserved2.
*/
typedef struct {
   union {
      struct {

         /* Source filename: mvls_tn7_hpdpll.ipxact.csr, line: 294         */
         uint16_t ldo_reserved2 : 16; /* bits 15 to 0; R */
      } B;
      uint16_t word;
   } ;
} Mvls_tn7_hpdpll_MAIN_MAIN_Register26_t;

/* Typedef for Register: mvls_tn7_hpdpll_MAIN::MAIN::Register27            */
/* Source filename: mvls_tn7_hpdpll.ipxact.csr, line: 299                  */
/* Description:                                                            */
/**
 *    Contains field values for: ldo_reserved3.
*/
typedef struct {
   union {
      struct {

         /* Source filename: mvls_tn7_hpdpll.ipxact.csr, line: 302         */
         uint16_t ldo_reserved3 : 16; /* bits 15 to 0; R */
      } B;
      uint16_t word;
   } ;
} Mvls_tn7_hpdpll_MAIN_MAIN_Register27_t;

/* Typedef for Register: mvls_tn7_hpdpll_MAIN::MAIN::Register28            */
/* Source filename: mvls_tn7_hpdpll.ipxact.csr, line: 307                  */
/* Description:                                                            */
/**
 *    Contains field values for: ldo_reserved4.
*/
typedef struct {
   union {
      struct {

         /* Source filename: mvls_tn7_hpdpll.ipxact.csr, line: 310         */
         uint16_t ldo_reserved4 : 16; /* bits 15 to 0; R */
      } B;
      uint16_t word;
   } ;
} Mvls_tn7_hpdpll_MAIN_MAIN_Register28_t;

/* Typedef for Register: mvls_tn7_hpdpll_MAIN::MAIN::Register29            */
/* Source filename: mvls_tn7_hpdpll.ipxact.csr, line: 315                  */
/* Description:                                                            */
/**
 *    Contains field values for: ldo_reserved5.
*/
typedef struct {
   union {
      struct {

         /* Source filename: mvls_tn7_hpdpll.ipxact.csr, line: 318         */
         uint16_t ldo_reserved5 : 16; /* bits 15 to 0; R */
      } B;
      uint16_t word;
   } ;
} Mvls_tn7_hpdpll_MAIN_MAIN_Register29_t;

/* Typedef for Register: mvls_tn7_hpdpll_MAIN::MAIN::Register30            */
/* Source filename: mvls_tn7_hpdpll.ipxact.csr, line: 323                  */
/* Description:                                                            */
/**
 *    Contains field values for: ldo_reserved6.
*/
typedef struct {
   union {
      struct {

         /* Source filename: mvls_tn7_hpdpll.ipxact.csr, line: 326         */
         uint16_t ldo_reserved6 : 16; /* bits 15 to 0; R */
      } B;
      uint16_t word;
   } ;
} Mvls_tn7_hpdpll_MAIN_MAIN_Register30_t;

/* Typedef for Register: mvls_tn7_hpdpll_MAIN::MAIN::Register31            */
/* Source filename: mvls_tn7_hpdpll.ipxact.csr, line: 331                  */
/* Description:                                                            */
/**
 *    Contains field values for: ldo_reserved7.
*/
typedef struct {
   union {
      struct {

         /* Source filename: mvls_tn7_hpdpll.ipxact.csr, line: 334         */
         uint16_t ldo_reserved7 : 16; /* bits 15 to 0; R */
      } B;
      uint16_t word;
   } ;
} Mvls_tn7_hpdpll_MAIN_MAIN_Register31_t;

/* Typedef for Register: mvls_tn7_hpdpll_MAIN::MAIN::Register32            */
/* Source filename: mvls_tn7_hpdpll.ipxact.csr, line: 339                  */
/* Description:                                                            */
/**
 *    Contains field values for: osc_cap_trim, osc_power_mode.
*/
typedef struct {
   union {
      struct {

         /* Source filename: mvls_tn7_hpdpll.ipxact.csr, line: 342         */
         uint16_t osc_cap_trim : 3; /* bits 2 to 0; R/W */

         /* Source filename: mvls_tn7_hpdpll.ipxact.csr, line: 345         */
         uint16_t osc_power_mode : 1; /* bit 3; R/W */
         uint16_t : 12; /* bits 15 to 4 */
      } B;
      uint16_t word;
   } ;
} Mvls_tn7_hpdpll_MAIN_MAIN_Register32_t;

/* Typedef for Register: mvls_tn7_hpdpll_MAIN::MAIN::Register33            */
/* Source filename: mvls_tn7_hpdpll.ipxact.csr, line: 349                  */
/* Description:                                                            */
/**
 *    Contains field values for: phase_obs_sel, phase_obs_en.
*/
typedef struct {
   union {
      struct {

         /* Source filename: mvls_tn7_hpdpll.ipxact.csr, line: 352         */
         uint16_t phase_obs_sel : 4; /* bits 3 to 0; R/W */

         /* Source filename: mvls_tn7_hpdpll.ipxact.csr, line: 355         */
         uint16_t phase_obs_en : 1; /* bit 4; R/W */
         uint16_t : 11; /* bits 15 to 5 */
      } B;
      uint16_t word;
   } ;
} Mvls_tn7_hpdpll_MAIN_MAIN_Register33_t;

/* Typedef for Register: mvls_tn7_hpdpll_MAIN::MAIN::Register34            */
/* Source filename: mvls_tn7_hpdpll.ipxact.csr, line: 359                  */
/* Description:                                                            */
/**
 *    Contains field values for: reserved.
*/
typedef struct {
   union {
      struct {

         /* Source filename: mvls_tn7_hpdpll.ipxact.csr, line: 362         */
         uint16_t reserved : 16; /* bits 15 to 0; R */
      } B;
      uint16_t word;
   } ;
} Mvls_tn7_hpdpll_MAIN_MAIN_Register34_t;

/* Typedef for Register: mvls_tn7_hpdpll_MAIN::MAIN::Register35            */
/* Source filename: mvls_tn7_hpdpll.ipxact.csr, line: 367                  */
/* Description:                                                            */
/**
 *    Contains field values for: freq_monitor_enable, 
 *    freq_monitor_clkref_div_code, freq_monitor_clk_div_code, 
 *    freq_monitor_clock_sel.
*/
typedef struct {
   union {
      struct {

         /* Source filename: mvls_tn7_hpdpll.ipxact.csr, line: 372         */
         uint16_t freq_monitor_enable : 1; /* bit 0; R/W */

         /* Source filename: mvls_tn7_hpdpll.ipxact.csr, line: 375         */
         uint16_t freq_monitor_clkref_div_code : 5; /* bits 5 to 1; R/W */

         /* Source filename: mvls_tn7_hpdpll.ipxact.csr, line: 378         */
         uint16_t freq_monitor_clk_div_code : 5; /* bits 10 to 6; R/W */

         /* Source filename: mvls_tn7_hpdpll.ipxact.csr, line: 381         */
         uint16_t freq_monitor_clock_sel : 5; /* bits 15 to 11; R/W */
      } B;
      uint16_t word;
   } ;
} Mvls_tn7_hpdpll_MAIN_MAIN_Register35_t;

/* Typedef for Register: mvls_tn7_hpdpll_MAIN::MAIN::Register36            */
/* Source filename: mvls_tn7_hpdpll.ipxact.csr, line: 385                  */
/* Description:                                                            */
/**
 *    Contains field values for: freq_monitor_clkref_count.
*/
typedef struct {
   union {
      struct {

         /* Source filename: mvls_tn7_hpdpll.ipxact.csr, line: 388         */
         uint16_t freq_monitor_clkref_count : 16; /* bits 15 to 0; R/W */
      } B;
      uint16_t word;
   } ;
} Mvls_tn7_hpdpll_MAIN_MAIN_Register36_t;

/* Typedef for Register: mvls_tn7_hpdpll_MAIN::MAIN::Register37            */
/* Source filename: mvls_tn7_hpdpll.ipxact.csr, line: 392                  */
/* Description:                                                            */
/**
 *    Contains field values for: freq_monitor_clk_count0.
*/
typedef struct {
   union {
      struct {

         /* Source filename: mvls_tn7_hpdpll.ipxact.csr, line: 395         */
         uint16_t freq_monitor_clk_count0 : 16; /* bits 15 to 0; R */
      } B;
      uint16_t word;
   } ;
} Mvls_tn7_hpdpll_MAIN_MAIN_Register37_t;

/* Typedef for Register: mvls_tn7_hpdpll_MAIN::MAIN::Register38            */
/* Source filename: mvls_tn7_hpdpll.ipxact.csr, line: 401                  */
/* Description:                                                            */
/**
 *    Contains field values for: freq_monitor_clk_count1.
*/
typedef struct {
   union {
      struct {

         /* Source filename: mvls_tn7_hpdpll.ipxact.csr, line: 404         */
         uint16_t freq_monitor_clk_count1 : 16; /* bits 15 to 0; R */
      } B;
      uint16_t word;
   } ;
} Mvls_tn7_hpdpll_MAIN_MAIN_Register38_t;

/* Typedef for Register: mvls_tn7_hpdpll_MAIN::MAIN::Register39            */
/* Source filename: mvls_tn7_hpdpll.ipxact.csr, line: 410                  */
/* Description:                                                            */
/**
 *    Contains field values for: dco_normalization_iteration_limit, 
 *    dco_normalization_threshold.
*/
typedef struct {
   union {
      struct {

         /* Source filename: mvls_tn7_hpdpll.ipxact.csr, line: 414         */
         uint16_t dco_normalization_iteration_limit : 5; /* bits 4 to 0; R/W */

         /* Source filename: mvls_tn7_hpdpll.ipxact.csr, line: 417         */
         uint16_t dco_normalization_threshold : 5; /* bits 9 to 5; R/W */
         uint16_t : 6; /* bits 15 to 10 */
      } B;
      uint16_t word;
   } ;
} Mvls_tn7_hpdpll_MAIN_MAIN_Register39_t;

/* Typedef for Register: mvls_tn7_hpdpll_MAIN::MAIN::Register40            */
/* Source filename: mvls_tn7_hpdpll.ipxact.csr, line: 421                  */
/* Description:                                                            */
/**
 *    Contains field values for: dynamic_normalization_interval_code, 
 *    dynamic_normalization_delta_kp_max, dynamic_normalization_delta_ki_max,
 *     dynamic_normalization_mode.
*/
typedef struct {
   union {
      struct {

         /* Source filename: mvls_tn7_hpdpll.ipxact.csr, line: 428         */
         uint16_t dynamic_normalization_interval_code : 5; /* bits 4 to 0; R/W */

         /* Source filename: mvls_tn7_hpdpll.ipxact.csr, line: 431         */
         uint16_t dynamic_normalization_delta_kp_max : 5; /* bits 9 to 5; R/W */

         /* Source filename: mvls_tn7_hpdpll.ipxact.csr, line: 434         */
         uint16_t dynamic_normalization_delta_ki_max : 5; /* bits 14 to 10; R/W */

         /* Source filename: mvls_tn7_hpdpll.ipxact.csr, line: 437         */
         uint16_t dynamic_normalization_mode : 1; /* bit 15; R/W */
      } B;
      uint16_t word;
   } ;
} Mvls_tn7_hpdpll_MAIN_MAIN_Register40_t;

/* Typedef for Register: mvls_tn7_hpdpll_MAIN::MAIN::Register56            */
/* Source filename: mvls_tn7_hpdpll.ipxact.csr, line: 441                  */
/* Description:                                                            */
/**
 *    Contains field values for: reg_update, reserved.
*/
typedef struct {
   union {
      struct {

         /* Source filename: mvls_tn7_hpdpll.ipxact.csr, line: 444         */
         uint16_t reg_update : 1; /* bit 0; R/W */

         /* Source filename: mvls_tn7_hpdpll.ipxact.csr, line: 447         */
         uint16_t reserved : 15; /* bits 15 to 1; R */
      } B;
      uint16_t word;
   } ;
} Mvls_tn7_hpdpll_MAIN_MAIN_Register56_t;

/* Typedef for Register: mvls_tn7_hpdpll_MAIN::MAIN::Register57            */
/* Source filename: mvls_tn7_hpdpll.ipxact.csr, line: 452                  */
/* Description:                                                            */
/**
 *    Contains field values for: lock_detect, reserved, freq_monitor_done, 
 *    freq_monitor_pass.
*/
typedef struct {
   union {
      struct {

         /* Source filename: mvls_tn7_hpdpll.ipxact.csr, line: 456         */
         uint16_t lock_detect : 1; /* bit 0; R */

         /* Source filename: mvls_tn7_hpdpll.ipxact.csr, line: 461         */
         uint16_t reserved : 7; /* bits 7 to 1; R */

         /* Source filename: mvls_tn7_hpdpll.ipxact.csr, line: 465         */
         uint16_t freq_monitor_done : 1; /* bit 8; R */

         /* Source filename: mvls_tn7_hpdpll.ipxact.csr, line: 470         */
         uint16_t freq_monitor_pass : 1; /* bit 9; R */
         uint16_t : 6; /* bits 15 to 10 */
      } B;
      uint16_t word;
   } ;
} Mvls_tn7_hpdpll_MAIN_MAIN_Register57_t;

/* Typedef for Group: mvls_tn7_hpdpll_MAIN::MAIN                           */
/* Source filename: mvls_tn7_hpdpll.ipxact.csr, line: 22                   */
typedef struct {
   Mvls_tn7_hpdpll_MAIN_MAIN_Register0_t Register0; /**< Offset 0x0 (R/W) */
   Mvls_tn7_hpdpll_MAIN_MAIN_Register1_t Register1; /**< Offset 0x2 (R/W) */
   Mvls_tn7_hpdpll_MAIN_MAIN_Register2_t Register2; /**< Offset 0x4 (R/W) */
   Mvls_tn7_hpdpll_MAIN_MAIN_Register3_t Register3; /**< Offset 0x6 (R/W) */
   Mvls_tn7_hpdpll_MAIN_MAIN_Register4_t Register4; /**< Offset 0x8 (R/W) */
   Mvls_tn7_hpdpll_MAIN_MAIN_Register5_t Register5; /**< Offset 0xa (R/W) */
   Mvls_tn7_hpdpll_MAIN_MAIN_Register6_t Register6; /**< Offset 0xc (R/W) */
   Mvls_tn7_hpdpll_MAIN_MAIN_Register7_t Register7; /**< Offset 0xe (R/W) */
   Mvls_tn7_hpdpll_MAIN_MAIN_Register8_t Register8; /**< Offset 0x10 (R/W) */
   Mvls_tn7_hpdpll_MAIN_MAIN_Register9_t Register9; /**< Offset 0x12 (R/W) */
   Mvls_tn7_hpdpll_MAIN_MAIN_Register10_t Register10; /**< Offset 0x14 (R/W) */
   Mvls_tn7_hpdpll_MAIN_MAIN_Register11_t Register11; /**< Offset 0x16 (R/W) */
   Mvls_tn7_hpdpll_MAIN_MAIN_Register12_t Register12; /**< Offset 0x18 (R/W) */
   Mvls_tn7_hpdpll_MAIN_MAIN_Register13_t Register13; /**< Offset 0x1a (R/W) */
   Mvls_tn7_hpdpll_MAIN_MAIN_Register14_t Register14; /**< Offset 0x1c (R/W) */
   Mvls_tn7_hpdpll_MAIN_MAIN_Register15_t Register15; /**< Offset 0x1e (R/W) */
   Mvls_tn7_hpdpll_MAIN_MAIN_Register16_t Register16; /**< Offset 0x20 (R) */
   uint8_t _pad0[0xa];
   Mvls_tn7_hpdpll_MAIN_MAIN_Register22_t Register22; /**< Offset 0x2c (R/W) */
   Mvls_tn7_hpdpll_MAIN_MAIN_Register23_t Register23; /**< Offset 0x2e (R/W) */
   Mvls_tn7_hpdpll_MAIN_MAIN_Register24_t Register24; /**< Offset 0x30 (R) */
   Mvls_tn7_hpdpll_MAIN_MAIN_Register25_t Register25; /**< Offset 0x32 (R) */
   Mvls_tn7_hpdpll_MAIN_MAIN_Register26_t Register26; /**< Offset 0x34 (R) */
   Mvls_tn7_hpdpll_MAIN_MAIN_Register27_t Register27; /**< Offset 0x36 (R) */
   Mvls_tn7_hpdpll_MAIN_MAIN_Register28_t Register28; /**< Offset 0x38 (R) */
   Mvls_tn7_hpdpll_MAIN_MAIN_Register29_t Register29; /**< Offset 0x3a (R) */
   Mvls_tn7_hpdpll_MAIN_MAIN_Register30_t Register30; /**< Offset 0x3c (R) */
   Mvls_tn7_hpdpll_MAIN_MAIN_Register31_t Register31; /**< Offset 0x3e (R) */
   Mvls_tn7_hpdpll_MAIN_MAIN_Register32_t Register32; /**< Offset 0x40 (R/W) */
   Mvls_tn7_hpdpll_MAIN_MAIN_Register33_t Register33; /**< Offset 0x42 (R/W) */
   Mvls_tn7_hpdpll_MAIN_MAIN_Register34_t Register34; /**< Offset 0x44 (R) */
   Mvls_tn7_hpdpll_MAIN_MAIN_Register35_t Register35; /**< Offset 0x46 (R/W) */
   Mvls_tn7_hpdpll_MAIN_MAIN_Register36_t Register36; /**< Offset 0x48 (R/W) */
   Mvls_tn7_hpdpll_MAIN_MAIN_Register37_t Register37; /**< Offset 0x4a (R) */
   Mvls_tn7_hpdpll_MAIN_MAIN_Register38_t Register38; /**< Offset 0x4c (R) */
   Mvls_tn7_hpdpll_MAIN_MAIN_Register39_t Register39; /**< Offset 0x4e (R/W) */
   Mvls_tn7_hpdpll_MAIN_MAIN_Register40_t Register40; /**< Offset 0x50 (R/W) */
   uint8_t _pad1[0x1e];
   Mvls_tn7_hpdpll_MAIN_MAIN_Register56_t Register56; /**< Offset 0x70 (R/W) */
   Mvls_tn7_hpdpll_MAIN_MAIN_Register57_t Register57; /**< Offset 0x72 (R) */
   uint8_t _pad2[0x1f8c];
} Mvls_tn7_hpdpll_MAIN_MAIN_t;

/* Typedef for Addressmap: mvls_tn7_hpdpll_MAIN                            */
/* Source filename: mvls_tn7_hpdpll.ipxact.csr, line: 477                  */
typedef struct {
   Mvls_tn7_hpdpll_MAIN_MAIN_t MAIN; /**< Offset 0x0 (R/W) */
} Mvls_tn7_hpdpll_MAIN_t;

#endif
